<?php
$a = $_POST['a'] ;
echo '<p>' . $a . '</p>' ;


if ($a!=0  && $a%3==0 && $a%5==0 && $a%7==0) 
{
echo "Дели се и на 3, и на 5, и на 7";
} 

elseif ($a!=0 && $a%3==0 && $a%5==0) 
{
echo "Дели се и на 3, и на 5, но не и на 7";
}

elseif ($a!=0 && $a%5==0 && $a%7==0 ) 
{
echo "Дели се и на 5, и на 7, но не и на 3";
}
elseif ($a!=0 && $a%3==0 && $a%7==0) 
{
echo "Дели се и на 3, и на 7, но не и на 5";
}
elseif ($a!=0 && $a%5==0) 
{
echo "Дели се само на 5";
}
elseif ($a!=0 && $a%3==0) 
{
echo "Дели се само на 3";
}
elseif ($a!=0 && $a%7==0) 
{
echo "Дели се само на 7";
}
elseif ($a==0) 
{
echo "Not a valid entry";
}
else
{
	echo "Не се дели нито на 3, нито на 5, нито на 7!";
}
?>
<html>
<ul> <a href="forma-delenie.php"> Начало <a/> </ul>
</html>